#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_FaceCustomization

#include "Basic.hpp"

#include "Human_Male_Faces_Enum_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_FaceCustomization.AC_FaceCustomization_C
// 0x0308 (0x03C8 - 0x00C0)
class UAC_FaceCustomization_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<int32>                                 UpdateFurMaterialIndeces;                          // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       MyMIDs;                                            // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Brows;                          // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Eyes;                           // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Jaw;                            // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Mouth;                          // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Ears;                           // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Nose;                           // 0x0140(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Scalp;                          // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceScalp;                                         // 0x0160(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceBrows;                                         // 0x0170(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceEyes;                                          // 0x0180(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceNose;                                          // 0x0190(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceMouth;                                         // 0x01A0(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceJaw;                                           // 0x01B0(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceEars;                                          // 0x01C0(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<class FString>                         FaceRegions;                                       // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHuman_Male_Faces_Enum                        FaceA;                                             // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceA_Prev;                                        // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceB;                                             // 0x01E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceB_Prev;                                        // 0x01E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceC;                                             // 0x01E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceC_Prev;                                        // 0x01E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeadAdditiveAlpha;                                 // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bNormalizeFaceAlphas;                              // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateDeltaMaps;                                  // 0x01F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUpdateBones;                                      // 0x01F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUpdateFacialAnimation;                            // 0x01F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPlayFacialTestAnimation;                          // 0x01F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                FaceScalp_Prev;                                    // 0x01F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceBrows_Prev;                                    // 0x0208(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceEyes_Prev;                                     // 0x0218(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceNose_Prev;                                     // 0x0228(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceMouth_Prev;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceJaw_Prev;                                      // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceEars_Prev;                                     // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> DeltaP_Map_Textures;                               // 0x0268(0x0050)(Edit, BlueprintVisible)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> DeltaN_Map_Textures;                               // 0x02B8(0x0050)(Edit, BlueprintVisible)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> Normal_Map_Textures;                               // 0x0308(0x0050)(Edit, BlueprintVisible)
	class APlayerPawnTest_C*                      As_Player_Pawn_Test;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Dynamic_Material_Params_Scalar;                    // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Scalar_Names;              // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Vector_Names;              // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        Dynamic_Material_Params_Vector;                    // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Texture_Names;             // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture*>                       Dynamic_Material_Params_Texture;                   // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ParamsArrayWasCleared;                             // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateOnTick;                                     // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ResetFaceWeights();
	void SetParamsRecursively();
	void ClearMaterialParamArrays();
	void UpdateSkinTextures();
	void ClampFaceAlphas(TArray<double>& FaceCurrent, TArray<double>& FacePrev);
	void UpdateDeltaMaps();
	void UpdateFaceRegionValues();
	void InitMaterials();
	void ReceiveBeginPlay();
	void ForceTick();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_AC_FaceCustomization(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_FaceCustomization_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_FaceCustomization_C")
	}
	static class UAC_FaceCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_FaceCustomization_C>();
	}
};
DUMPER7_ASSERTS_UAC_FaceCustomization_C;

}

