#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalUIData_BP

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GlobalUIData_BP.GlobalUIData_BP_C
// 0x0CF0 (0x0E20 - 0x0130)
class UGlobalUIData_BP_C : public UPrimalGlobalUIData
{
public:
	struct FHUDElement                            StruggleHUDElementTemplate;                        // 0x0130(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHUDRichTextOverlayData                StruggleHUDRichTextOverlay;                        // 0x0300(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           StruggleHUDRichTextColor;                          // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StruggleHUDRichTextBlinkSpeed;                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DefaultStruggleHUDTextString;                      // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FHUDElement                            FuelOrAmmoHUDElementTemplate;                      // 0x0398(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHUDElement                            FuelOrAmmoHUDElementTemplate_LC;                   // 0x0568(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FuelOrAmmoSpaceBetweenSlots;                       // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDTextColor_Default;                    // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDTextColor_Low;                        // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDTextColor_Critical;                   // 0x0760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDTextColor_Upgrade1;                   // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDTextColor_Upgrade2;                   // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDBackgroundColor_Default;              // 0x0790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDBackgroundColor_Low;                  // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDBackgroundColor_Critical;             // 0x07B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDBackgroundColor_Upgrade1;             // 0x07C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDBackgroundColor_Upgrade2;             // 0x07D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDForegroundColor_Default;              // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDForegroundColor_Low;                  // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDForegroundColor_Critical;             // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDForegroundColor_Upgrade1;             // 0x0810(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FuelOrAmmoHUDForegroundColor_Upgrade2;             // 0x0820(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHUDElement                            FuelOrAmmoExtraBarHUDElementTemplate;              // 0x0830(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FuelOrAmmoExtraBarOffsetY;                         // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FuelOrAmmoExtraBarLocationSpanOffsetMult;          // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHUDElement>                    FuelOrAmmoSlotsInUse;                              // 0x0A10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHUDElement                            FuelOrAmmoHUDElementFrameTemplate;                 // 0x0A20(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHUDElement                            FuelOrAmmoHUDElementFrameTemplate_LC;              // 0x0BF0(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   FuelOrAmmoHUDTextColors_LC;                        // 0x0DC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   FuelOrAmmoHUDBackgroundColors_LC;                  // 0x0DD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   FuelOrAmmoHUDForegroundColors_LC;                  // 0x0DE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLinearColor>                   FuelOrAmmoHUDIconColors_LC;                        // 0x0DF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     FuelOrAmmoHUDBackgroundImageOverrides;             // 0x0E00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     FuelOrAmmoHUDForegroundImageOverrides;             // 0x0E10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BPGetHUDElements_Module_FuelOrAmmo(int32 SlotIndex, int32 StateIndex, double progress, const class FString& MainText, const class FString& ExtendedInfoText, class UTexture2D* Icon, const struct FLinearColor& CustomBGColor, const struct FLinearColor& CustomProgressColor, int32 Style, const class FString& CustomRichText, struct FHUDElement* OutHUDElement);
	void BPGetHUDElements_Module_FuelOrAmmo_ExtraBar(int32 SlotOffset, int32 SlotSpan, int32 StateIndex, double progress, const class FString& ExtendedInfoText, struct FHUDElement* OutHUDElement);
	void BPGetHUDElements_Module_FuelOrAmmo_Frame(const struct FHUDElement& InHUDElement, const struct FLinearColor& CustomColor, int32 Style, const class FString& CustomRichText, bool UseInElementTextColor, struct FHUDElement* OutHUDElement);
	void BPGetHUDElements_Module_Struggle(class APlayerController* ForPC, double StruggleProgressPercent, const class FString& RichTextOverride, class AActor* Instigator, TArray<struct FHUDElement>* Elements, struct FHUDRichTextOverlayData* OutHUDRichTextOverlay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GlobalUIData_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GlobalUIData_BP_C")
	}
	static class UGlobalUIData_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalUIData_BP_C>();
	}
};
DUMPER7_ASSERTS_UGlobalUIData_BP_C;

}

