#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_Discovery_BannerSpotlight

#include "Basic.hpp"

#include "cfcore_structs.hpp"
#include "Engine_structs.hpp"
#include "CFCoreWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_Discovery_BannerSpotlight.UI_CFCore_Discovery_BannerSpotlight_C
// 0x0158 (0x0988 - 0x0830)
class UUI_CFCore_Discovery_BannerSpotlight_C final : public UCFCoreWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_CFCore_Discovery_BannerSpotlight_C; // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0838(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_BackOutlineforBackground;                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Showcase;                                      // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Showcase_FadeIn;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageTitle;                                    // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_219;                                     // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Install_C*     UI_Button_CFCore_Global_VIewAll;                   // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Tag_WhiteCategory_C*         UI_CFCore_WhiteCategoryPreview_0;                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Overlay_C*                   UI_Overlay;                                        // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ShelveTitle;                                       // 0x0888(0x0010)(Edit, BlueprintVisible)
	struct FShelf                                 Shelf;                                             // 0x0898(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUI_CFCore_Discovery_C*                 UI_Discovery;                                      // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__UI_CFCore_Discovery_BannerSpotlight_UI_Button_CFCore_Global_VIewAll_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();
	void BndEvt__UI_GoToFeaturedCreator_UI_Button_Ark_Global_VIewAll_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature();
	void BndEvt__UI_GoToFeaturedCreator_UI_Button_Ark_Global_VIewAll_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature();
	void Create(const struct FShelf& Shelf_0);
	void ExecuteUbergraph_UI_CFCore_Discovery_BannerSpotlight(int32 EntryPoint);
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);
	void OnFail_082B674A42E76991867B6581F03A8A4D(class UTexture2DDynamic* Texture);
	void OnSuccess_082B674A42E76991867B6581F03A8A4D(class UTexture2DDynamic* Texture);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_Discovery_BannerSpotlight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_Discovery_BannerSpotlight_C")
	}
	static class UUI_CFCore_Discovery_BannerSpotlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_Discovery_BannerSpotlight_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_Discovery_BannerSpotlight_C;

}

