#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_FailedToLoad

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_CFCore_FailedToLoad.UI_CFCore_FailedToLoad_C.ExecuteUbergraph_UI_CFCore_FailedToLoad
// 0x0010 (0x0010 - 0x0000)
struct UI_CFCore_FailedToLoad_C_ExecuteUbergraph_UI_CFCore_FailedToLoad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_FailedToLoad_C_ExecuteUbergraph_UI_CFCore_FailedToLoad;

// Function UI_CFCore_FailedToLoad.UI_CFCore_FailedToLoad_C.GetRootCFWidget
// 0x0010 (0x0010 - 0x0000)
struct UI_CFCore_FailedToLoad_C_GetRootCFWidget final
{
public:
	class UPanelWidget*                           RootPanelWidget;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_FailedToLoad_C_GetRootCFWidget;

}

