#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_Discovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "cfcore_structs.hpp"
#include "UI_CFCore_BasePage_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_Discovery.UI_CFCore_Discovery_C
// 0x0190 (0x09F0 - 0x0860)
class UUI_CFCore_Discovery_C final : public UUI_CFCore_BasePage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_CFCore_Discovery_C;              // 0x0860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInPage;                                        // 0x0868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowcaseSwapIMG;                                   // 0x0870(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_CarouselCate;                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_CarouselCate_1;                      // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BackGround;                                    // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ShowcasePreview;                               // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ShowcasePreview_Blackness;                     // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ShowcasePreviewFadeIn;                         // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_FullPage;                                // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_FullPage;                                  // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             SizeBox_ShowcaseRow;                               // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Description;                                  // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DescriptionEndsSaleTime;                      // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DescriptionSale;                              // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_EndsIn;                                       // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageTitle;                                    // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageTitle_6;                                  // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_TimeTillEnd;                                  // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Back_C*        UI_Button_Back;                                    // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Install_C*     UI_Button_CFCore_ViewMod;                          // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Install_C*     UI_Button_CFCore_ViewMod_1;                        // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Install_C*     UI_Button_CFCore_ViewMod_2;                        // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Master_C*      UI_Button_Options;                                 // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_BannerSpotlight_C* UI_CFCore_Discovery_BannerSpotlight;               // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_GoToBrowseAllMods_C*         UI_GoToBrowseAllMods_248;                          // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_ShowcaseSlot_C*    UI_ShowcaseSlot_1st;                               // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_ShowcaseSlot_C*    UI_ShowcaseSlot_2nd;                               // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_ShowcaseSlot_C*    UI_ShowcaseSlot_3rd;                               // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_ShowcaseSlot_C*    UI_ShowcaseSlot_4th;                               // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_ShowcaseSlot_C*    UI_ShowcaseSlot_5th;                               // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_GeneratedList;                         // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_FrontPageLayout;                    // 0x0960(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUI_CFCore_Discovery_ShowcaseSlot_C*> ListOfShowcaseSlots;                          // 0x0968(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ShowcaseSlotIndexPreview;                          // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int64>                                 Mod_Id;                                            // 0x0980(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ReadyDiscovery;                                    // 0x0990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_CFCore_Discovery_Spotlight_C*       SpotlightPreview;                                  // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              RequestExit;                                       // 0x09A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FModsHighlightsV3                      DiscoveryGenerationData;                           // 0x09B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	int64                                         RequestedSpotlightPage;                            // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestedOpenSpotlight;                           // 0x09E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBuiltCarousel;                                 // 0x09E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_CFCore_Discovery_UI_Button_CFCore_Global_Back_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature();
	void BndEvt__UI_CFCore_Discovery_UI_Button_CFCore_Global_Back_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature();
	void BndEvt__UI_CFCore_Discovery_UI_Button_CFCore_ViewMod_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void BndEvt__UI_CFCore_Discovery_UI_Button_Options_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature();
	void BndEvt__UI_Discovery_UI_Button_Ark_ViewMod_1_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();
	bool BPGamepadReleased(const struct FKey& theKey);
	void Build_Discovery_Tab();
	void ConstructDiscovery();
	void CreateCarousel();
	void Debug_Discovery_Generation(const struct FModsHighlightsV3& ModsHighlightsV3);
	void DestroySpotlightPreview();
	void DestroySpotlightPreviewTempCopy();
	void ExecuteUbergraph_UI_CFCore_Discovery(int32 EntryPoint);
	void FadeAndSwapCarousel();
	void GenerateDiscoveryShelves();
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);
	void GoToCarouselItemDestination(const struct FCarouselItemDestination& CarouselItemDestination);
	void IMG_ShowcasePreview_Event(class UImage* IMG_ShowcasePreview_0);
	void NextShowcase();
	void OnErrorGetModHighlights(const struct FCFCoreError& Error);
	void OnModHighlightFound(const struct FModsHighlightsV3& mods);
	void OnPressVieAllPurchased();
	void OnPressViewAllLatest();
	void OnPressViewAllOnMostDL();
	void OpenSpotlight(int64 SpotlightID);
	void OpenSpotlightShowcasePage();
	void PreConstruct(bool IsDesignTime);
	void ResetAllFilters();
	void ReturnFromModPage();
	void SequenceEvent__ENTRYPOINTUI_CFCore_Discovery(class UImage* IMG_ShowcasePreview_0);
	void SetToNewCurrentShowcaseSlot(class UUI_CFCore_Discovery_ShowcaseSlot_C* NewSlot);
	void SortByIndexShelveArray();
	void Start_Progress();
	void StartDiscoveryOnReady();
	void UpdateCarouselFromMod(class UUI_CFCore_Discovery_ShowcaseSlot_C* ShowcaseSlot);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_Discovery_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_Discovery_C")
	}
	static class UUI_CFCore_Discovery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_Discovery_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_Discovery_C;

}

