#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_CustomComboBoxSpacer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_CFCore_CustomComboBoxSpacer.UI_CFCore_CustomComboBoxSpacer_C.ExecuteUbergraph_UI_CFCore_CustomComboBoxSpacer
// 0x0018 (0x0018 - 0x0000)
struct UI_CFCore_CustomComboBoxSpacer_C_ExecuteUbergraph_UI_CFCore_CustomComboBoxSpacer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_CustomComboBoxSpacer_C_ExecuteUbergraph_UI_CFCore_CustomComboBoxSpacer;

// Function UI_CFCore_CustomComboBoxSpacer.UI_CFCore_CustomComboBoxSpacer_C.GetRootCFWidget
// 0x0010 (0x0010 - 0x0000)
struct UI_CFCore_CustomComboBoxSpacer_C_GetRootCFWidget final
{
public:
	class UPanelWidget*                           RootPanelWidget;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetRootCFWidget_RootPanelWidget;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_CustomComboBoxSpacer_C_GetRootCFWidget;

// Function UI_CFCore_CustomComboBoxSpacer.UI_CFCore_CustomComboBoxSpacer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CFCore_CustomComboBoxSpacer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_CustomComboBoxSpacer_C_PreConstruct;

}

