#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENUM_CFCore_LoadingProgress_structs.hpp"
#include "CFCoreWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_Loading.UI_CFCore_Loading_C
// 0x0058 (0x0888 - 0x0830)
class UUI_CFCore_Loading_C final : public UCFCoreWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_CFCore_Loading_C;                // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutPage;                                       // 0x0838(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_InstallProgress;                       // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Loading;                                   // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_RT_3;                                         // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Back_C*        UI_Button_CFCore_Global_BackLoading;               // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Interp;                                            // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetLoading;                                     // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_CFCore_LoadingProgress                   CurrentPhaseOfLoad;                                // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClickedReturn;                                   // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_CFCore_Loading_UI_Button_CFCore_Global_BackLoading_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_UI_CFCore_Loading(int32 EntryPoint);
	void FadeOutLoading();
	ENUM_CFCore_LoadingProgress GetNextSafePhase();
	double GetPhaseValues(ENUM_CFCore_LoadingProgress Index_0);
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);
	void ResetLoading();
	void RestartLoading();
	void SetLoadingStage(ENUM_CFCore_LoadingProgress Loading_Stage);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_Loading_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_Loading_C")
	}
	static class UUI_CFCore_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_Loading_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_Loading_C;

}

