#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_NotificationManager

#include "Basic.hpp"

#include "cfcore_ui_structs.hpp"


namespace SDK::Params
{

// Function UI_CFCore_NotificationManager.UI_CFCore_NotificationManager_C.CreateNotify
// 0x0020 (0x0020 - 0x0000)
struct UI_CFCore_NotificationManager_C_CreateNotify final
{
public:
	class UUI_CFCore_Notification_C*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_CFCore_Notification_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_NotificationManager_C_CreateNotify;

// Function UI_CFCore_NotificationManager.UI_CFCore_NotificationManager_C.ExecuteUbergraph_UI_CFCore_NotificationManager
// 0x0658 (0x0658 - 0x0000)
struct UI_CFCore_NotificationManager_C_ExecuteUbergraph_UI_CFCore_NotificationManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_CFCore_Notification_C*              CallFunc_CreateNotify_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstallProgressMod                    K2Node_CustomEvent_InstallProgressMod;             // 0x0018(0x0608)(ConstParm, ContainsInstancedReference)
	class FString                                 CallFunc_GetModName_Name;                          // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0630(0x0010)()
	class UUI_CFCore_Notification_C*              CallFunc_CreateNotify_ReturnValue_1;               // 0x0640(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_CFCore_Notification_C*              CallFunc_CreateNotify_ReturnValue_2;               // 0x0648(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_CFCore_Notification_C*              CallFunc_CreateNotify_ReturnValue_3;               // 0x0650(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CFCore_NotificationManager_C_ExecuteUbergraph_UI_CFCore_NotificationManager;

// Function UI_CFCore_NotificationManager.UI_CFCore_NotificationManager_C.PlayInstalledNotification
// 0x0608 (0x0608 - 0x0000)
struct UI_CFCore_NotificationManager_C_PlayInstalledNotification final
{
public:
	struct FInstallProgressMod                    InstallProgressMod;                                // 0x0000(0x0608)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_UI_CFCore_NotificationManager_C_PlayInstalledNotification;

}

