#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_Button_UpvoteRate

#include "Basic.hpp"

#include "CFCoreWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_Button_UpvoteRate.UI_CFCore_Button_UpvoteRate_C
// 0x0028 (0x0858 - 0x0830)
class UUI_CFCore_Button_UpvoteRate_C final : public UCFCoreWidget_C
{
public:
	class UHorizontalBox*                         HorizontalBox_18;                                  // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_LikeRatio;                                     // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_UpvoteRate;                                   // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_ModPage_C*                   UI_ModPage;                                        // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_CFCore_ParentBrowser_C*             UI_BrowseMods;                                     // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_Button_UpvoteRate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_Button_UpvoteRate_C")
	}
	static class UUI_CFCore_Button_UpvoteRate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_Button_UpvoteRate_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_Button_UpvoteRate_C;

}

