#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_GoToBrowseAllMods

#include "Basic.hpp"

#include "CFCoreWidget_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_GoToBrowseAllMods.UI_CFCore_GoToBrowseAllMods_C
// 0x0040 (0x0870 - 0x0830)
class UUI_CFCore_GoToBrowseAllMods_C final : public UCFCoreWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_CFCore_GoToBrowseAllMods_C;      // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_34;                                        // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DescriptionExplanation;                       // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageTitle;                                    // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_CFCore_Global_Install_C*     UI_Button_Ark_Global_Install;                      // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Overlay_C*                   UI_Overlay;                                        // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CFCore_Discovery_C*                 Discovery;                                         // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyThemeSettingsToAll();
	void BndEvt__UI_GoToBrowseAllMods_UI_Button_Ark_Global_Install_K2Node_ComponentBoundEvent_2_OnReleased__DelegateSignature();
	void ExecuteUbergraph_UI_CFCore_GoToBrowseAllMods(int32 EntryPoint);
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_GoToBrowseAllMods_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_GoToBrowseAllMods_C")
	}
	static class UUI_CFCore_GoToBrowseAllMods_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_GoToBrowseAllMods_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_GoToBrowseAllMods_C;

}

