#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CFCore_NoModsInstalledFound

#include "Basic.hpp"

#include "CFCoreWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CFCore_NoModsInstalledFound.UI_CFCore_NoModsInstalledFound_C
// 0x0028 (0x0858 - 0x0830)
class UUI_CFCore_NoModsInstalledFound_C final : public UCFCoreWidget_C
{
public:
	class UImage*                                 IMG_NoModsBackground;                              // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_LongTextExplanation;                          // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_NoInstalledMods;                              // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerBox_NoInstalledMods;                            // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void GetRootCFWidget(class UPanelWidget** RootPanelWidget);
	void ApplyThemeSettingsToAll();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CFCore_NoModsInstalledFound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CFCore_NoModsInstalledFound_C")
	}
	static class UUI_CFCore_NoModsInstalledFound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CFCore_NoModsInstalledFound_C>();
	}
};
DUMPER7_ASSERTS_UUI_CFCore_NoModsInstalledFound_C;

}

